cmsis-svd/cmsis-svd/data/NXP/LPC5512.svd
        <register>
          <name>SEC_GPIO_MASK0</name>
          <description>Secure GPIO mask for port 0 pins.</description>
          <addressOffset>0xF80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO0_PIN0_SEC_MASK</name>
              <description>Secure mask for pin P0_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN1_SEC_MASK</name>
              <description>Secure mask for pin P0_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN2_SEC_MASK</name>
              <description>Secure mask for pin P0_2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN3_SEC_MASK</name>
              <description>Secure mask for pin P0_3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN4_SEC_MASK</name>
              <description>Secure mask for pin P0_4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN5_SEC_MASK</name>
              <description>Secure mask for pin P0_5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN6_SEC_MASK</name>
              <description>Secure mask for pin P0_6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN7_SEC_MASK</name>
              <description>Secure mask for pin P0_7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN8_SEC_MASK</name>
              <description>Secure mask for pin P0_8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN9_SEC_MASK</name>
              <description>Secure mask for pin P0_9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN10_SEC_MASK</name>
              <description>Secure mask for pin P0_10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN11_SEC_MASK</name>
              <description>Secure mask for pin P0_11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN12_SEC_MASK</name>
              <description>Secure mask for pin P0_12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN13_SEC_MASK</name>
              <description>Secure mask for pin P0_13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN14_SEC_MASK</name>
              <description>Secure mask for pin P0_14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN15_SEC_MASK</name>
              <description>Secure mask for pin P0_15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN16_SEC_MASK</name>
              <description>Secure mask for pin P0_16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN17_SEC_MASK</name>
              <description>Secure mask for pin P0_17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN18_SEC_MASK</name>
              <description>Secure mask for pin P0_18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN19_SEC_MASK</name>
              <description>Secure mask for pin P0_19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN20_SEC_MASK</name>
              <description>Secure mask for pin P0_20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN21_SEC_MASK</name>
              <description>Secure mask for pin P0_21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN22_SEC_MASK</name>
              <description>Secure mask for pin P0_22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN23_SEC_MASK</name>
              <description>Secure mask for pin P0_23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN24_SEC_MASK</name>
              <description>Secure mask for pin P0_24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN25_SEC_MASK</name>
              <description>Secure mask for pin P0_25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN26_SEC_MASK</name>
              <description>Secure mask for pin P0_26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN27_SEC_MASK</name>
              <description>Secure mask for pin P0_27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO0_PIN28_SEC_MASK</name>
              <description>Secure mask for pin P0_28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
